{
  "appName": "Тестовое задание SquareGPS",
  "en": "Английский",
  "ru": "Русский",
  "messages-codes": {
    "can-not-recognize-address": "Ошибка распознавания адреса",
    "marker-already-added": "Маркер уже добавлен",
    "get-all-markers":  "Все маркеры получены",
    "reject-all-markers": "Не удалось получить все маркеры",
    "add-message-success":  "Маркер добавлен успешно",
    "add-message-reject": "Не удалось добавить маркер"
  },
  "menu": {
    "about": "О задании",
    "map": "Карта"
  },
  "map": {
    "latitude": "Широта",
    "longitude": "Долгота"
  },
  "markers": "Маркеры",
  "emptyList": "Список пуст",
  "views": {
    "about": {
      "example": "Пример",
      "exampleImageAlt": "Пример страницы карт",
      "additionally": "Дополнительно:",
      "note": "<b>Напоминание:</b> тестовое задание призвано показать умение писать хороший модульный код, а также умение пользоваться указанными технологиями и не только. Этим кодом нужно гордиться.",
      "section": {
        "main": {
          "title": "Тестовое задание SquareGPS",
          "text": "Необходимо с помощью <b>Vuejs</b>, <b>Vuex</b>, <b>VueRouter</b>, <b>Vuetify</b> написать приложение. Хэдер приложения должен содержать меню из 2-х пунктов: О задании и Карта. В основной части приложения должно отображаться содержимое разделов."
        },
        "about": {
          "title": "Раздел “О задании”",
          "text": "В разделе должен быть текст этого задания, сверстанный аналогично."
        },
        "map": {
          "title": "Раздел “Карта”",
          "text": [
            "На экране должны быть карта и список (<a href=\"#example\">см. пример</a>):",
            "Для поиска адреса можно использовать любое бесплатное API для геокодирования, например:",
            "В случае, если адрес не найден, необходимо вывести ошибку и не добавлять маркер в список.",
            "Локальное хранение данных должно быть организовано в виде сервиса, эмулирующего бекенд. (Необходим класс Backend, который псевдо-асинхронно сохраняет данные в localStorage)."
          ],
          "list": [
            "При клике на кнопку добавления, карта должна перейти в режим добавления маркера: в месте клика должен появится маркер, а в списке - запись с адресом точки.",
            "При клике на маркер должна подсвечиваться запись в списке",
            "При клике на запись в списке карта должна центрироваться на маркере",
            "Маркеры должны храниться локально и не пропадать после перезагрузки страницы",
            "В адресной строке должен отображаться id выбранного маркера"
          ],
          "additionalList": [
            "Продумать отображение на мобильных устройствах.",
            "Предусмотреть локализацию.",
            "Необходимо с помощью jest написть 1 модульный тест на любой компонент."
          ]
        }
      }
    }
  }
}
