<template>
  <v-container>
    <v-row>
      <v-col tag="article">
        <section id="title">
          <h1 class="display-1 mb-1">
            Тестовое задание SquareGPS
          </h1>
          <p>
            Необходимо с помощью <b>Vuejs</b>, <b>Vuex</b>, <b>VueRouter</b>, <b>Vuetify</b> написать приложение.
            Хэдер приложения должен содержать меню из 2-х пунктов: О задании и Карта.
            В основной части приложения должно отображаться содержимое разделов.
          </p>
        </section>
        <section id="about">
          <h2 class="headline mb-1">
            Раздел “О задании”
          </h2>
          <p>
            В разделе должен быть текст этого задания, сверстанный аналогично.
          </p>
        </section>
        <section id="map">
          <h2 class="headline mb-1">
            Раздел “Карта”
          </h2>
          <p>
            На экране должны быть карта и список (<a href="#example">см. пример</a>):
            <ol>
              <li>
                При клике на кнопку добавления, карта должна перейти в режим добавления маркера: в месте клика должен
                появится маркер, а в списке - запись с адресом точки.
              </li>
            </ol>
          </p>
          <p>
            Для поиска адреса можно использовать любое бесплатное API для геокодирования, например:
            <a
              href="https://geocode.maps.co/"
              target="_blank"
              rel="nofollow noreferrer external"
            >
              https://geocode.maps.co/
            </a>
          </p>
          <p>
            В случае, если адрес не найден, необходимо вывести ошибку и не добавлять маркер в список.
            <br>
            <ol start="2">
              <li>При клике на маркер должна подсвечиваться запись в списке</li>
              <li>При клике на запись в списке карта должна центрироваться на маркере</li>
              <li>Маркеры должны храниться локально и не пропадать после перезагрузки страницы</li>
              <li>В адресной строке должен отображаться id выбранного маркера</li>
            </ol>
          </p>
          <p>
            Локальное хранение данных должно быть организовано в виде сервиса, эмулирующего бекенд. (Необходим класс
            Backend, который псевдо-асинхронно сохраняет данные в localStorage).
          </p>
          <p>
            <b>Дополнительно:</b>
            <ol>
              <li>Продумать отображение на мобильных устройствах.</li>
              <li>Предусмотреть локализацию.</li>
              <li>Необходимо с помощью jest написть 1 модульный тест на любой компонент.</li>
            </ol>
          </p>
          <p>
            <b>Напоминание:</b> тестовое задание призвано показать умение писать хороший модульный код, а также умение
            пользоваться указанными технологиями и не только. Этим кодом нужно гордиться.
          </p>
          <p id="example">
            Пример:
            <br>
            <img
              class="example-image"
              src="@/assets/images/example.jpg"
              alt="Пример страницы карт"
            >
          </p>
        </section>
      </v-col>
    </v-row>
  </v-container>
</template>

<script lang="ts">
import Vue from 'vue';

export default Vue.extend({
  name: 'HomeView',
});
</script>

<style scoped lang="scss">
.example-image {
  display: block;
  width: 100%;
}
</style>
